books.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>My Library</title>
<!-- 2016-02-03 Wed 21:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">My Library</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Artificial Intelligence and Expert Systems</a>
<ul>
<li>
<ul>
<li><a href="#sec-2-0-1">Bio Inspired Artificial Intelligence - Floreano &amp; Mattiusi&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ai">ai</span></span></a></li>
<li><a href="#sec-2-0-2">Expert Systems - Principals and Programming - Giarratano &amp; Riley&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ai">ai</span></span></a></li>
<li><a href="#sec-2-0-3">Machine Learning A Probablistic Perspective - Murphy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ai">ai</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">Computer Science</a>
<ul>
<li>
<ul>
<li><a href="#sec-3-0-1">The Art of Computer Programming (Vol 1) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></a></li>
<li><a href="#sec-3-0-2">The Art of Computer Programming (Vol 2) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></a></li>
<li><a href="#sec-3-0-3">The Art of Computer Programming (Vol 3) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></a></li>
<li><a href="#sec-3-0-4">The Art of Computer Programming (Vol 4a) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">Design and Modeling</a>
<ul>
<li>
<ul>
<li><a href="#sec-4-0-1">Design Patterns - Gamma, Helm, Johnson, Vlissides&#xa0;&#xa0;&#xa0;<span class="tag"><span class="modeling">modeling</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">Languages</a>
<ul>
<li><a href="#sec-5-1">C++</a>
<ul>
<li><a href="#sec-5-1-1">C++ Template Metaprogramming - Abrahams &amp; Gurtovoy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-2">The C++ Programming Language (4th Edition) - Stroustrup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-3">Classic Data Structures in C++ - Budd&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-4">The C++ Standard Library (2nd Edition) - Josuttis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-5">Advanced C++ - Coplien&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-6">Exceptional C++ - Sutter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-7">More Exceptional C++ - Sutter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-8">Exceptional C++ Style - Sutter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-9">C++ Coding Standards - Sutter, Alexandrescu&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-10">Modern C++ Design - Alexandrescu&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-11">Effective C++ (3rd Edition) - Meyers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-12">More Effective C++ - Meyers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
<li><a href="#sec-5-1-13">Effective STL - Meyers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></a></li>
</ul>
</li>
<li><a href="#sec-5-2">Lisp</a>
<ul>
<li><a href="#sec-5-2-1">Practical Common Lisp - Siebel&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lisp">lisp</span></span></a></li>
<li><a href="#sec-5-2-2">Structure and Interpretation of Computer Programs - Abelson &amp; Sussman&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lisp">lisp</span>&#xa0;<span class="compsci">compsci</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">Mathematics</a>
<ul>
<li>
<ul>
<li><a href="#sec-6-0-1">Numerical Recipes in C (2nd Edition) - Press&#xa0;&#xa0;&#xa0;<span class="tag"><span class="c">c</span>&#xa0;<span class="maths">maths</span></span></a></li>
<li><a href="#sec-6-0-2">Numerical Analysis - Turner&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maths">maths</span></span></a></li>
<li><a href="#sec-6-0-3">Dr Euler's Fabulous Formula - Paul J. Nahim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maths">maths</span></span></a></li>
<li><a href="#sec-6-0-4">e - The story of a number - Eli Maor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maths">maths</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">Others</a></li>
<li><a href="#sec-8">Security</a>
<ul>
<li>
<ul>
<li><a href="#sec-8-0-1">Applied Cryptography - Schneier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypto">crypto</span></span></a></li>
<li><a href="#sec-8-0-2">Modern Cryptanalysis - Swenson&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypto">crypto</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-9">Typography</a>
<ul>
<li>
<ul>
<li><a href="#sec-9-0-1">The TeXbook - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-2">TeX the program - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-3">The MetaFont book - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-4">MetaFont the program  - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-5">Computer Modern Typefaces - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-6">Digital Typography - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-7">The PDF Reference (Version 1.6)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-8">Fonts &amp; Encoding - Haralambous&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-9">The Unicode Standard 5.0&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-10">XSL-FO Developer's Handbook - Lovell&#xa0;&#xa0;&#xa0;<span class="tag"><span class="xml">xml</span>&#xa0;<span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-11">Understanding Japanese Infomation Processing - Lunde&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-12">PDF Explained - Whittington&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></a></li>
<li><a href="#sec-9-0-13">Just My Type - Simon Garfield&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-10">User Interface Design</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a list of my collection of technical books, along with other
books that influence my day to day work.
</p>

<p>
I have to admit to not reading all of these books from cover to cover,
and some of them have not been opened, let alone read recently. As I
reread them, I will add notes to the entries.
</p>

<p>
(List is currently incomplete)
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Artificial Intelligence and Expert Systems</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-0-1" class="outline-4">
<h4 id="sec-2-0-1">Bio Inspired Artificial Intelligence - Floreano &amp; Mattiusi&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ai">ai</span></span></h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
This is a great book on how advances in biology and neuro science
can impact artificial intelligence research and development. It
discusses the theory and application of:
</p>

<ul class="org-ul">
<li>Evolutionary Systems and Artificial Evolution
</li>
<li>Cellular Systems and Artificial Life
</li>
<li>Neural Systems and Neural Networks
</li>
<li>Developmental Systems (closely linked with Cellular Systems)
</li>
<li>Immune Systems
</li>
<li>Behavioral Systems and Machine Learning
</li>
<li>Collective Systems, Swarms and Cooperation
</li>
</ul>

<p>
The book provides an overview of the current state of the science
in each area, usually written in language clear enough for a non
scientist to understand, before moving on to discuss the
implication of this science on how artificial intelligence could
be developed and applied.
</p>
</div>
</div>

<div id="outline-container-sec-2-0-2" class="outline-4">
<h4 id="sec-2-0-2">Expert Systems - Principals and Programming - Giarratano &amp; Riley&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ai">ai</span></span></h4>
</div>
<div id="outline-container-sec-2-0-3" class="outline-4">
<h4 id="sec-2-0-3">Machine Learning A Probablistic Perspective - Murphy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ai">ai</span></span></h4>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Computer Science</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-0-1" class="outline-4">
<h4 id="sec-3-0-1">The Art of Computer Programming (Vol 1) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></h4>
</div>
<div id="outline-container-sec-3-0-2" class="outline-4">
<h4 id="sec-3-0-2">The Art of Computer Programming (Vol 2) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></h4>
</div>
<div id="outline-container-sec-3-0-3" class="outline-4">
<h4 id="sec-3-0-3">The Art of Computer Programming (Vol 3) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></h4>
</div>
<div id="outline-container-sec-3-0-4" class="outline-4">
<h4 id="sec-3-0-4">The Art of Computer Programming (Vol 4a) - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="compsci">compsci</span></span></h4>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Design and Modeling</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-0-1" class="outline-4">
<h4 id="sec-4-0-1">Design Patterns - Gamma, Helm, Johnson, Vlissides&#xa0;&#xa0;&#xa0;<span class="tag"><span class="modeling">modeling</span></span></h4>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Languages</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">C++</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">C++ Template Metaprogramming - Abrahams &amp; Gurtovoy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">The C++ Programming Language (4th Edition) - Stroustrup&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3">Classic Data Structures in C++ - Budd&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4">The C++ Standard Library (2nd Edition) - Josuttis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-5" class="outline-4">
<h4 id="sec-5-1-5">Advanced C++ - Coplien&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-6" class="outline-4">
<h4 id="sec-5-1-6">Exceptional C++ - Sutter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-7" class="outline-4">
<h4 id="sec-5-1-7">More Exceptional C++ - Sutter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-8" class="outline-4">
<h4 id="sec-5-1-8">Exceptional C++ Style - Sutter&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-9" class="outline-4">
<h4 id="sec-5-1-9">C++ Coding Standards - Sutter, Alexandrescu&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-10" class="outline-4">
<h4 id="sec-5-1-10">Modern C++ Design - Alexandrescu&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-11" class="outline-4">
<h4 id="sec-5-1-11">Effective C++ (3rd Edition) - Meyers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-12" class="outline-4">
<h4 id="sec-5-1-12">More Effective C++ - Meyers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
<div id="outline-container-sec-5-1-13" class="outline-4">
<h4 id="sec-5-1-13">Effective STL - Meyers&#xa0;&#xa0;&#xa0;<span class="tag"><span class="cpp">cpp</span></span></h4>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Lisp</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1">Practical Common Lisp - Siebel&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lisp">lisp</span></span></h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
A good general introduction to common lisp, including macors,
error handling, object oriented programming, file I/O &#x2026; the
usual.
</p>

<p>
My meanderings in lisp for 2016 can be found <a href="2016-lisp.html">here</a>.
</p>
</div>
</div>
<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2">Structure and Interpretation of Computer Programs - Abelson &amp; Sussman&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lisp">lisp</span>&#xa0;<span class="compsci">compsci</span></span></h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
If there is one book you must read on programming, then this is the
one. Although it is written with Scheme as the language to develop
ideas, it has some fascinating discussions about software
abstraction. There are lots of mind blowing demonstrations in it and
the <a href="http://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-001-structure-and-interpretation-of-computer-programs-spring-2005/video-lectures/">video lectures</a>.
</p>

<p>
The example that made me smile was the following example of using
functions and local bindings to create data structures. Given that;
</p>

<div class="org-src-container">

<pre class="src src-scheme">(car (cons x y))
<span style="color: #586e75; font-style: italic;">; </span><span style="color: #586e75; font-style: italic;">=&gt; x</span>
(cdr (cons x y))
<span style="color: #586e75; font-style: italic;">; </span><span style="color: #586e75; font-style: italic;">=&gt; y</span>
</pre>
</div>

<p>
Then we can define cons and cdr as:
</p>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #859900;">define</span> (<span style="color: #268bd2;">cons</span> x y)
<span id="coderef-cons" class="coderef-off">    (<span style="color: #859900;">lambda</span> (m) (m x y)))</span>

(<span style="color: #859900;">define</span> (<span style="color: #268bd2;">car</span> x)
<span id="coderef-car" class="coderef-off">    (x (<span style="color: #859900;">lambda</span> (a d) a)))</span>

(<span style="color: #859900;">define</span> (<span style="color: #268bd2;">cdr</span> x)
<span id="coderef-cdr" class="coderef-off">    (x (<span style="color: #859900;">lambda</span> (a d) d)))</span>
</pre>
</div>

<p>
The cons function <a href="#coderef-cons"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cons');" onmouseout="CodeHighlightOff(this, 'coderef-cons');">returns a lambda</a>. This lambda takes a function (in
the form of a lambda) which is applied to x and y. The car function
<a href="#coderef-car"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-car');" onmouseout="CodeHighlightOff(this, 'coderef-car');">applies the function returned by cons</a> using a lambda that return the
first argument and the cdr function <a href="#coderef-cdr"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cdr');" onmouseout="CodeHighlightOff(this, 'coderef-cdr');">applies the function returned by
cons</a> using a lambda that returns the second argument.
</p>

<p>
Of course this is not terribly efficient, but it shows what is
possible and blurs the line between code and data yet again, as lisp
is fond of doing
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Mathematics</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-0-1" class="outline-4">
<h4 id="sec-6-0-1">Numerical Recipes in C (2nd Edition) - Press&#xa0;&#xa0;&#xa0;<span class="tag"><span class="c">c</span>&#xa0;<span class="maths">maths</span></span></h4>
</div>
<div id="outline-container-sec-6-0-2" class="outline-4">
<h4 id="sec-6-0-2">Numerical Analysis - Turner&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maths">maths</span></span></h4>
</div>
<div id="outline-container-sec-6-0-3" class="outline-4">
<h4 id="sec-6-0-3">Dr Euler's Fabulous Formula - Paul J. Nahim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maths">maths</span></span></h4>
<div class="outline-text-4" id="text-6-0-3">
<p>
I've just started reading this book about Euler's formula:
</p>

<p>
$$e^{i\pi} + 1 = 0$$
</p>

<p>
I've not got very far with it and the maths is a little bit above
what I am used to.
</p>
</div>
</div>

<div id="outline-container-sec-6-0-4" class="outline-4">
<h4 id="sec-6-0-4">e - The story of a number - Eli Maor&#xa0;&#xa0;&#xa0;<span class="tag"><span class="maths">maths</span></span></h4>
<div class="outline-text-4" id="text-6-0-4">
<p>
I decided to read this before reading Dr Euler's Fabulous
Formula. I have made a few notes <a href="Mathematics/e.html">here</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Others</h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Security</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-0-1" class="outline-4">
<h4 id="sec-8-0-1">Applied Cryptography - Schneier&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypto">crypto</span></span></h4>
</div>
<div id="outline-container-sec-8-0-2" class="outline-4">
<h4 id="sec-8-0-2">Modern Cryptanalysis - Swenson&#xa0;&#xa0;&#xa0;<span class="tag"><span class="crypto">crypto</span></span></h4>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Typography</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-0-1" class="outline-4">
<h4 id="sec-9-0-1">The TeXbook - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-2" class="outline-4">
<h4 id="sec-9-0-2">TeX the program - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-3" class="outline-4">
<h4 id="sec-9-0-3">The MetaFont book - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-4" class="outline-4">
<h4 id="sec-9-0-4">MetaFont the program  - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-5" class="outline-4">
<h4 id="sec-9-0-5">Computer Modern Typefaces - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tex">tex</span>&#xa0;<span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-6" class="outline-4">
<h4 id="sec-9-0-6">Digital Typography - Knuth&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-7" class="outline-4">
<h4 id="sec-9-0-7">The PDF Reference (Version 1.6)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-8" class="outline-4">
<h4 id="sec-9-0-8">Fonts &amp; Encoding - Haralambous&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-9" class="outline-4">
<h4 id="sec-9-0-9">The Unicode Standard 5.0&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-10" class="outline-4">
<h4 id="sec-9-0-10">XSL-FO Developer's Handbook - Lovell&#xa0;&#xa0;&#xa0;<span class="tag"><span class="xml">xml</span>&#xa0;<span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-11" class="outline-4">
<h4 id="sec-9-0-11">Understanding Japanese Infomation Processing - Lunde&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-12" class="outline-4">
<h4 id="sec-9-0-12">PDF Explained - Whittington&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></h4>
</div>
<div id="outline-container-sec-9-0-13" class="outline-4">
<h4 id="sec-9-0-13">Just My Type - Simon Garfield&#xa0;&#xa0;&#xa0;<span class="tag"><span class="typo">typo</span></span></h4>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">User Interface Design</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-03 Wed 21:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
